FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016 - 2019 , NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_CLOCK_H_
    #define _FSL_CLOCK_H_

    #include "fsl_common.h"

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Definitions
 *****************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.3.1. */
    #define FSL_CLOCK_DRIVER_VERSION    ( MAKE_VERSION( 2, 3, 1 ) )
/*@}*/

/*! @brief Configure whether driver controls clock
 *
 * When set to 0, peripheral drivers will enable clock in initialize function
 * and disable clock in de-initialize function. When set to 1, peripheral
 * driver will not control the clock, application could control the clock out of
 * the driver.
 *
 * @note All drivers share this feature switcher. If it is set to 1, application
 * should handle clock enable and disable for all drivers.
 */
    #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) )
        #define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL    0
    #endif

/*!
 * @brief User-defined the size of cache for CLOCK_PllGetConfig() function.
 *
 * Once define this MACRO to be non-zero value, CLOCK_PllGetConfig() function
 * would cache the recent calulation and accelerate the execution to get the
 * right settings.
 */
    #ifndef CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT
        #define CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT    2U
    #endif

/* Definition for delay API in clock driver, users can redefine it to the real application. */
    #ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
        #define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY    ( 180000000UL )
    #endif

/*! @brief Clock ip name array for ADC. */
    #define ADC_CLOCKS \
    {                  \
        kCLOCK_Adc0    \
    }
/*! @brief Clock ip name array for ROM. */
    #define ROM_CLOCKS \
    {                  \
        kCLOCK_Rom     \
    }
/*! @brief Clock ip name array for SRAM. */
    #define SRAM_CLOCKS                          \
    {                                            \
        kCLOCK_Sram1, kCLOCK_Sram2, kCLOCK_Sram3 \
    }
/*! @brief Clock ip name array for FLASH. */
    #define FLASH_CLOCKS \
    {                    \
        kCLOCK_Flash     \
    }
/*! @brief Clock ip name array for FMC. */
    #define FMC_CLOCKS \
    {                  \
        kCLOCK_Fmc     \
    }
/*! @brief Clock ip name array for EEPROM. */
    #define EEPROM_CLOCKS \
    {                     \
        kCLOCK_Eeprom     \
    }
/*! @brief Clock ip name array for SPIFI. */
    #define SPIFI_CLOCKS \
    {                    \
        kCLOCK_Spifi     \
    }
/*! @brief Clock ip name array for INPUTMUX. */
    #define INPUTMUX_CLOCKS \
    {                       \
        kCLOCK_InputMux     \
    }
/*! @brief Clock ip name array for IOCON. */
    #define IOCON_CLOCKS \
    {                    \
        kCLOCK_Iocon     \
    }
/*! @brief Clock ip name array for GPIO. */
    #define GPIO_CLOCKS                                                                    \
    {                                                                                      \
        kCLOCK_Gpio0, kCLOCK_Gpio1, kCLOCK_Gpio2, kCLOCK_Gpio3, kCLOCK_Gpio4, kCLOCK_Gpio5 \
    }
/*! @brief Clock ip name array for PINT. */
    #define PINT_CLOCKS \
    {                   \
        kCLOCK_Pint     \
    }
/*! @brief Clock ip name array for GINT. */
    #define GINT_CLOCKS          \
    {                            \
        kCLOCK_Gint, kCLOCK_Gint \
    }
/*! @brief Clock ip name array for DMA. */
    #define DMA_CLOCKS \
    {                  \
        kCLOCK_Dma     \
    }
/*! @brief Clock ip name array for CRC. */
    #define CRC_CLOCKS \
    {                  \
        kCLOCK_Crc     \
    }
/*! @brief Clock ip name array for WWDT. */
    #define WWDT_CLOCKS \
    {                   \
        kCLOCK_Wwdt     \
    }
/*! @brief Clock ip name array for RTC. */
    #define RTC_CLOCKS \
    {                  \
        kCLOCK_Rtc     \
    }
/*! @brief Clock ip name array for ADC0. */
    #define ADC0_CLOCKS \
    {                   \
        kCLOCK_Adc0     \
    }
/*! @brief Clock ip name array for MRT. */
    #define MRT_CLOCKS \
    {                  \
        kCLOCK_Mrt     \
    }
/*! @brief Clock ip name array for RIT. */
    #define RIT_CLOCKS \
    {                  \
        kCLOCK_Rit     \
    }
/*! @brief Clock ip name array for SCT0. */
    #define SCT_CLOCKS \
    {                  \
        kCLOCK_Sct0    \
    }
/*! @brief Clock ip name array for MCAN. */
    #define MCAN_CLOCKS            \
    {                              \
        kCLOCK_Mcan0, kCLOCK_Mcan1 \
    }
/*! @brief Clock ip name array for UTICK. */
    #define UTICK_CLOCKS \
    {                    \
        kCLOCK_Utick     \
    }
/*! @brief Clock ip name array for FLEXCOMM. */
    #define FLEXCOMM_CLOCKS                                                                                         \
    {                                                                                                               \
        kCLOCK_FlexComm0, kCLOCK_FlexComm1, kCLOCK_FlexComm2, kCLOCK_FlexComm3, kCLOCK_FlexComm4, kCLOCK_FlexComm5, \
        kCLOCK_FlexComm6, kCLOCK_FlexComm7, kCLOCK_FlexComm8, kCLOCK_FlexComm9, kCLOCK_FlexComm10                   \
    }
/*! @brief Clock ip name array for LPUART. */
    #define LPUART_CLOCKS                                                                                     \
    {                                                                                                         \
        kCLOCK_MinUart0, kCLOCK_MinUart1, kCLOCK_MinUart2, kCLOCK_MinUart3, kCLOCK_MinUart4, kCLOCK_MinUart5, \
        kCLOCK_MinUart6, kCLOCK_MinUart7, kCLOCK_MinUart8, kCLOCK_MinUart9                                    \
    }

/*! @brief Clock ip name array for BI2C. */
    #define BI2C_CLOCKS                                                                                   \
    {                                                                                                     \
        kCLOCK_BI2c0, kCLOCK_BI2c1, kCLOCK_BI2c2, kCLOCK_BI2c3, kCLOCK_BI2c4, kCLOCK_BI2c5, kCLOCK_BI2c6, \
        kCLOCK_BI2c7, kCLOCK_BI2c8, kCLOCK_BI2c9                                                          \
    }
/*! @brief Clock ip name array for LSPI. */
    #define LPSI_CLOCKS                                                                                   \
    {                                                                                                     \
        kCLOCK_LSpi0, kCLOCK_LSpi1, kCLOCK_LSpi2, kCLOCK_LSpi3, kCLOCK_LSpi4, kCLOCK_LSpi5, kCLOCK_LSpi6, \
        kCLOCK_LSpi7, kCLOCK_LSpi8, kCLOCK_LSpi9                                                          \
    }
/*! @brief Clock ip name array for FLEXI2S. */
    #define FLEXI2S_CLOCKS                                                                                    \
    {                                                                                                         \
        kCLOCK_FlexI2s0, kCLOCK_FlexI2s1, kCLOCK_FlexI2s2, kCLOCK_FlexI2s3, kCLOCK_FlexI2s4, kCLOCK_FlexI2s5, \
        kCLOCK_FlexI2s6, kCLOCK_FlexI2s7, kCLOCK_FlexI2s8, kCLOCK_FlexI2s9                                    \
    }
/*! @brief Clock ip name array for DMIC. */
    #define DMIC_CLOCKS \
    {                   \
        kCLOCK_DMic     \
    }
/*! @brief Clock ip name array for CT32B. */
    #define CTIMER_CLOCKS                                                         \
    {                                                                             \
        kCLOCK_Ct32b0, kCLOCK_Ct32b1, kCLOCK_Ct32b2, kCLOCK_Ct32b3, kCLOCK_Ct32b4 \
    }
/*! @brief Clock ip name array for LCD. */
    #define LCD_CLOCKS \
    {                  \
        kCLOCK_Lcd     \
    }
/*! @brief Clock ip name array for SDIO. */
    #define SDIO_CLOCKS \
    {                   \
        kCLOCK_Sdio     \
    }
/*! @brief Clock ip name array for USBRAM. */
    #define USBRAM_CLOCKS \
    {                     \
        kCLOCK_UsbRam1    \
    }
/*! @brief Clock ip name array for EMC. */
    #define EMC_CLOCKS \
    {                  \
        kCLOCK_Emc     \
    }
/*! @brief Clock ip name array for ETH. */
    #define ETH_CLOCKS \
    {                  \
        kCLOCK_Eth     \
    }
/*! @brief Clock ip name array for AES. */
    #define AES_CLOCKS \
    {                  \
        kCLOCK_Aes     \
    }
/*! @brief Clock ip name array for OTP. */
    #define OTP_CLOCKS \
    {                  \
        kCLOCK_Otp     \
    }
/*! @brief Clock ip name array for RNG. */
    #define RNG_CLOCKS \
    {                  \
        kCLOCK_Rng     \
    }
/*! @brief Clock ip name array for USBHMR0. */
    #define USBHMR0_CLOCKS \
    {                      \
        kCLOCK_Usbhmr0     \
    }
/*! @brief Clock ip name array for USBHSL0. */
    #define USBHSL0_CLOCKS \
    {                      \
        kCLOCK_Usbhsl0     \
    }
/*! @brief Clock ip name array for SHA0. */
    #define SHA0_CLOCKS \
    {                   \
        kCLOCK_Sha0     \
    }
/*! @brief Clock ip name array for SMARTCARD. */
    #define SMARTCARD_CLOCKS                 \
    {                                        \
        kCLOCK_SmartCard0, kCLOCK_SmartCard1 \
    }
/*! @brief Clock ip name array for USBD. */
    #define USBD_CLOCKS                          \
    {                                            \
        kCLOCK_Usbd0, kCLOCK_Usbh1, kCLOCK_Usbd1 \
    }
/*! @brief Clock ip name array for USBH. */
    #define USBH_CLOCKS \
    {                   \
        kCLOCK_Usbh1    \
    }
/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */

/*------------------------------------------------------------------------------
*  clock_ip_name_t definition:
*  ------------------------------------------------------------------------------*/

    #define CLK_GATE_REG_OFFSET_SHIFT    8U
    #define CLK_GATE_REG_OFFSET_MASK     0xFFFFFF00U
    #define CLK_GATE_BIT_SHIFT_SHIFT     0U
    #define CLK_GATE_BIT_SHIFT_MASK      0x000000FFU

    #define CLK_GATE_DEFINE( reg_offset, bit_shift )                                   \
    ( ( ( ( reg_offset ) << CLK_GATE_REG_OFFSET_SHIFT ) & CLK_GATE_REG_OFFSET_MASK ) | \
      ( ( ( bit_shift ) << CLK_GATE_BIT_SHIFT_SHIFT ) & CLK_GATE_BIT_SHIFT_MASK ) )

