FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.h
    #define CLK_GATE_ABSTRACT_REG_OFFSET( x )    ( ( ( uint32_t ) ( x ) & CLK_GATE_REG_OFFSET_MASK ) >> CLK_GATE_REG_OFFSET_SHIFT )
    #define CLK_GATE_ABSTRACT_BITS_SHIFT( x )    ( ( ( uint32_t ) ( x ) & CLK_GATE_BIT_SHIFT_MASK ) >> CLK_GATE_BIT_SHIFT_SHIFT )

    #define AHB_CLK_CTRL0      0
    #define AHB_CLK_CTRL1      1
    #define AHB_CLK_CTRL2      2
    #define ASYNC_CLK_CTRL0    3

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
    typedef enum _clock_ip_name
    {
        kCLOCK_IpInvalid = 0U,
        kCLOCK_Rom = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 1 ),
        kCLOCK_Sram1 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 3 ),
        kCLOCK_Sram2 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 4 ),
        kCLOCK_Sram3 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 5 ),
        kCLOCK_Spifi = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 10 ),
        kCLOCK_InputMux = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 11 ),
        kCLOCK_Iocon = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 13 ),
        kCLOCK_Gpio0 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 14 ),
        kCLOCK_Gpio1 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 15 ),
        kCLOCK_Gpio2 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 16 ),
        kCLOCK_Gpio3 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 17 ),
        kCLOCK_Pint = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 18 ),
        kCLOCK_Gint = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 19 ),
        kCLOCK_Dma = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 20 ),
        kCLOCK_Crc = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 21 ),
        kCLOCK_Wwdt = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 22 ),
        kCLOCK_Rtc = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 23 ),
        kCLOCK_Adc0 = CLK_GATE_DEFINE( AHB_CLK_CTRL0, 27 ),
        kCLOCK_Mrt = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 0 ),
        kCLOCK_Rit = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 1 ),
        kCLOCK_Sct0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 2 ),
        kCLOCK_Mcan0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 7 ),
        kCLOCK_Mcan1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 8 ),
        kCLOCK_Utick = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 10 ),
        kCLOCK_FlexComm0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 11 ),
        kCLOCK_FlexComm1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 12 ),
        kCLOCK_FlexComm2 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 13 ),
        kCLOCK_FlexComm3 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 14 ),
        kCLOCK_FlexComm4 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 15 ),
        kCLOCK_FlexComm5 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 16 ),
        kCLOCK_FlexComm6 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 17 ),
        kCLOCK_FlexComm7 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 18 ),
        kCLOCK_MinUart0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 11 ),
        kCLOCK_MinUart1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 12 ),
        kCLOCK_MinUart2 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 13 ),
        kCLOCK_MinUart3 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 14 ),
        kCLOCK_MinUart4 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 15 ),
        kCLOCK_MinUart5 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 16 ),
        kCLOCK_MinUart6 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 17 ),
        kCLOCK_MinUart7 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 18 ),
        kCLOCK_LSpi0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 11 ),
        kCLOCK_LSpi1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 12 ),
        kCLOCK_LSpi2 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 13 ),
        kCLOCK_LSpi3 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 14 ),
        kCLOCK_LSpi4 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 15 ),
        kCLOCK_LSpi5 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 16 ),
        kCLOCK_LSpi6 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 17 ),
        kCLOCK_LSpi7 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 18 ),
        kCLOCK_BI2c0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 11 ),
        kCLOCK_BI2c1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 12 ),
        kCLOCK_BI2c2 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 13 ),
        kCLOCK_BI2c3 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 14 ),
        kCLOCK_BI2c4 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 15 ),
        kCLOCK_BI2c5 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 16 ),
        kCLOCK_BI2c6 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 17 ),
        kCLOCK_BI2c7 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 18 ),
        kCLOCK_FlexI2s0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 11 ),
        kCLOCK_FlexI2s1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 12 ),
        kCLOCK_FlexI2s2 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 13 ),
        kCLOCK_FlexI2s3 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 14 ),
        kCLOCK_FlexI2s4 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 15 ),
        kCLOCK_FlexI2s5 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 16 ),
        kCLOCK_FlexI2s6 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 17 ),
        kCLOCK_FlexI2s7 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 18 ),
        kCLOCK_DMic = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 19 ),
        kCLOCK_Ct32b2 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 22 ),
        kCLOCK_Usbd0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 25 ),
        kCLOCK_Ct32b0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 26 ),
        kCLOCK_Ct32b1 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 27 ),
        kCLOCK_BodyBias0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 29 ),
        kCLOCK_EzhArchB0 = CLK_GATE_DEFINE( AHB_CLK_CTRL1, 31 ),
        kCLOCK_Lcd = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 2 ),
        kCLOCK_Sdio = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 3 ),
        kCLOCK_Usbh1 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 4 ),
        kCLOCK_Usbd1 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 5 ),
        kCLOCK_UsbRam1 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 6 ),
        kCLOCK_Emc = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 7 ),
        kCLOCK_Eth = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 8 ),
        kCLOCK_Gpio4 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 9 ),
        kCLOCK_Gpio5 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 10 ),
        kCLOCK_Aes = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 11 ),
        kCLOCK_Otp = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 12 ),
        kCLOCK_Rng = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 13 ),
        kCLOCK_FlexComm8 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 14 ),
        kCLOCK_FlexComm9 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 15 ),
        kCLOCK_MinUart8 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 14 ),
        kCLOCK_MinUart9 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 15 ),
        kCLOCK_LSpi8 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 14 ),
        kCLOCK_LSpi9 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 15 ),
        kCLOCK_BI2c8 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 14 ),
        kCLOCK_BI2c9 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 15 ),
        kCLOCK_FlexI2s8 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 14 ),
        kCLOCK_FlexI2s9 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 15 ),
        kCLOCK_Usbhmr0 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 16 ),
        kCLOCK_Usbhsl0 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 17 ),
        kCLOCK_Sha0 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 18 ),
        kCLOCK_SmartCard0 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 19 ),
        kCLOCK_SmartCard1 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 20 ),
        kCLOCK_FlexComm10 = CLK_GATE_DEFINE( AHB_CLK_CTRL2, 21 ),

        kCLOCK_Ct32b3 = CLK_GATE_DEFINE( ASYNC_CLK_CTRL0, 13 ),
        kCLOCK_Ct32b4 = CLK_GATE_DEFINE( ASYNC_CLK_CTRL0, 14 )
    } clock_ip_name_t;

/*! @brief Clock name used to get clock frequency. */
    typedef enum _clock_name
    {
        kCLOCK_CoreSysClk,  /*!< Core/system clock  (aka MAIN_CLK)                       */
        kCLOCK_BusClk,      /*!< Bus clock (AHB clock)                                   */
        kCLOCK_ClockOut,    /*!< CLOCKOUT                                                */
        kCLOCK_FroHf,       /*!< FRO48/96                                                */
        kCLOCK_UsbPll,      /*!< USB1 PLL                                                */
        kCLOCK_Mclk,        /*!< MCLK                                                    */
        kCLOCK_Fro12M,      /*!< FRO12M                                                  */
        kCLOCK_ExtClk,      /*!< External Clock                                          */
        kCLOCK_PllOut,      /*!< PLL Output                                              */
        kCLOCK_UsbClk,      /*!< USB input                                               */
        kCLOCK_WdtOsc,      /*!< Watchdog Oscillator                                     */
        kCLOCK_Frg,         /*!< Frg Clock                                               */
        kCLOCK_AsyncApbClk, /*!< Async APB clock                                         */
    } clock_name_t;

/**
 * Clock source selections for the asynchronous APB clock
 */
    typedef enum _async_clock_src
    {
        kCLOCK_AsyncMainClk = 0, /*!< Main System clock */
        kCLOCK_AsyncFro12Mhz,    /*!< 12MHz FRO */
        kCLOCK_AsyncAudioPllClk,
        kCLOCK_AsyncI2cClkFc6,
    } async_clock_src_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

    #define CLK_ATTACH_ID( mux, sel, pos )    ( ( ( ( uint32_t ) ( mux ) << 0U ) | ( ( ( uint32_t ) ( sel ) + 1U ) & 0xFU ) << 8U ) << ( ( pos ) * 12U ) )
    #define MUX_A( mux, sel )                 CLK_ATTACH_ID( ( mux ), ( sel ), 0U )
    #define MUX_B( mux, sel, selector )       ( CLK_ATTACH_ID( ( mux ), ( sel ), 1U ) | ( ( selector ) << 24U ) )

    #define GET_ID_ITEM( connection )         ( ( connection ) & 0xFFFU )
    #define GET_ID_NEXT_ITEM( connection )    ( ( connection ) >> 12U )
    #define GET_ID_ITEM_MUX( connection )     ( ( uint8_t ) ( ( connection ) & 0xFFU ) )
    #define GET_ID_ITEM_SEL( connection )     ( ( uint8_t ) ( ( ( ( connection ) & 0xF00U ) >> 8U ) - 1U ) )
    #define GET_ID_SELECTOR( connection )     ( ( connection ) & 0xF000000U )

    #define CM_STICKCLKSEL       0
    #define CM_MAINCLKSELA       1
    #define CM_MAINCLKSELB       2
    #define CM_CLKOUTCLKSELA     3
    #define CM_SYSPLLCLKSEL      5
    #define CM_AUDPLLCLKSEL      7
    #define CM_SPIFICLKSEL       9
    #define CM_ADCASYNCCLKSEL    10
    #define CM_USB0CLKSEL        11
    #define CM_USB1CLKSEL        12
    #define CM_FXCOMCLKSEL0      13
    #define CM_FXCOMCLKSEL1      14
    #define CM_FXCOMCLKSEL2      15
    #define CM_FXCOMCLKSEL3      16
    #define CM_FXCOMCLKSEL4      17
    #define CM_FXCOMCLKSEL5      18
    #define CM_FXCOMCLKSEL6      19
    #define CM_FXCOMCLKSEL7      20
    #define CM_FXCOMCLKSEL8      21
    #define CM_FXCOMCLKSEL9      22
    #define CM_FXCOMCLKSEL10     23
    #define CM_MCLKCLKSEL        25
    #define CM_FRGCLKSEL         27
    #define CM_DMICCLKSEL        28
    #define CM_SCTCLKSEL         29
    #define CM_LCDCLKSEL         30
    #define CM_SDIOCLKSEL        31

