FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.h
    #define CM_ASYNCAPB          32U

    typedef enum _clock_attach_id
    {
        kSYSTICK_DIV_CLK_to_SYSTICKCLK = MUX_A( CM_STICKCLKSEL, 0 ),
        kWDT_OSC_to_SYSTICKCLK = MUX_A( CM_STICKCLKSEL, 1 ),
        kOSC32K_to_SYSTICKCLK = MUX_A( CM_STICKCLKSEL, 2 ),
        kFRO12M_to_SYSTICKCLK = MUX_A( CM_STICKCLKSEL, 3 ),
        kNONE_to_SYSTICKCLK = MUX_A( CM_STICKCLKSEL, 7 ),

        kFRO12M_to_MAIN_CLK = MUX_A( CM_MAINCLKSELA, 0 ) | MUX_B( CM_MAINCLKSELB, 0, 0 ),
        kEXT_CLK_to_MAIN_CLK = MUX_A( CM_MAINCLKSELA, 1 ) | MUX_B( CM_MAINCLKSELB, 0, 0 ),
        kWDT_OSC_to_MAIN_CLK = MUX_A( CM_MAINCLKSELA, 2 ) | MUX_B( CM_MAINCLKSELB, 0, 0 ),
        kFRO_HF_to_MAIN_CLK = MUX_A( CM_MAINCLKSELA, 3 ) | MUX_B( CM_MAINCLKSELB, 0, 0 ),
        kSYS_PLL_to_MAIN_CLK = MUX_A( CM_MAINCLKSELA, 0 ) | MUX_B( CM_MAINCLKSELB, 2, 0 ),
        kOSC32K_to_MAIN_CLK = MUX_A( CM_MAINCLKSELA, 0 ) | MUX_B( CM_MAINCLKSELB, 3, 0 ),

        kMAIN_CLK_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 0 ),
        kEXT_CLK_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 1 ),
        kWDT_OSC_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 2 ),
        kFRO_HF_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 3 ),
        kSYS_PLL_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 4 ),
        kUSB_PLL_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 5 ),
        kAUDIO_PLL_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 6 ),
        kOSC32K_OSC_to_CLKOUT = MUX_A( CM_CLKOUTCLKSELA, 7 ),

        kFRO12M_to_SYS_PLL = MUX_A( CM_SYSPLLCLKSEL, 0 ),
        kEXT_CLK_to_SYS_PLL = MUX_A( CM_SYSPLLCLKSEL, 1 ),
        kWDT_OSC_to_SYS_PLL = MUX_A( CM_SYSPLLCLKSEL, 2 ),
        kOSC32K_to_SYS_PLL = MUX_A( CM_SYSPLLCLKSEL, 3 ),
        kNONE_to_SYS_PLL = MUX_A( CM_SYSPLLCLKSEL, 7 ),

        kFRO12M_to_AUDIO_PLL = MUX_A( CM_AUDPLLCLKSEL, 0 ),
        kEXT_CLK_to_AUDIO_PLL = MUX_A( CM_AUDPLLCLKSEL, 1 ),
        kNONE_to_AUDIO_PLL = MUX_A( CM_AUDPLLCLKSEL, 7 ),

        kMAIN_CLK_to_SPIFI_CLK = MUX_A( CM_SPIFICLKSEL, 0 ),
        kSYS_PLL_to_SPIFI_CLK = MUX_A( CM_SPIFICLKSEL, 1 ),
        kUSB_PLL_to_SPIFI_CLK = MUX_A( CM_SPIFICLKSEL, 2 ),
        kFRO_HF_to_SPIFI_CLK = MUX_A( CM_SPIFICLKSEL, 3 ),
        kAUDIO_PLL_to_SPIFI_CLK = MUX_A( CM_SPIFICLKSEL, 4 ),
        kNONE_to_SPIFI_CLK = MUX_A( CM_SPIFICLKSEL, 7 ),

        kFRO_HF_to_ADC_CLK = MUX_A( CM_ADCASYNCCLKSEL, 0 ),
        kSYS_PLL_to_ADC_CLK = MUX_A( CM_ADCASYNCCLKSEL, 1 ),
        kUSB_PLL_to_ADC_CLK = MUX_A( CM_ADCASYNCCLKSEL, 2 ),
        kAUDIO_PLL_to_ADC_CLK = MUX_A( CM_ADCASYNCCLKSEL, 3 ),
        kNONE_to_ADC_CLK = MUX_A( CM_ADCASYNCCLKSEL, 7 ),

        kFRO_HF_to_USB0_CLK = MUX_A( CM_USB0CLKSEL, 0 ),
        kSYS_PLL_to_USB0_CLK = MUX_A( CM_USB0CLKSEL, 1 ),
        kUSB_PLL_to_USB0_CLK = MUX_A( CM_USB0CLKSEL, 2 ),
        kNONE_to_USB0_CLK = MUX_A( CM_USB0CLKSEL, 7 ),

        kFRO_HF_to_USB1_CLK = MUX_A( CM_USB1CLKSEL, 0 ),
        kSYS_PLL_to_USB1_CLK = MUX_A( CM_USB1CLKSEL, 1 ),
        kUSB_PLL_to_USB1_CLK = MUX_A( CM_USB1CLKSEL, 2 ),
        kNONE_to_USB1_CLK = MUX_A( CM_USB1CLKSEL, 7 ),

        kFRO12M_to_FLEXCOMM0 = MUX_A( CM_FXCOMCLKSEL0, 0 ),
        kFRO_HF_to_FLEXCOMM0 = MUX_A( CM_FXCOMCLKSEL0, 1 ),
        kAUDIO_PLL_to_FLEXCOMM0 = MUX_A( CM_FXCOMCLKSEL0, 2 ),
        kMCLK_to_FLEXCOMM0 = MUX_A( CM_FXCOMCLKSEL0, 3 ),
        kFRG_to_FLEXCOMM0 = MUX_A( CM_FXCOMCLKSEL0, 4 ),
        kNONE_to_FLEXCOMM0 = MUX_A( CM_FXCOMCLKSEL0, 7 ),

        kFRO12M_to_FLEXCOMM1 = MUX_A( CM_FXCOMCLKSEL1, 0 ),
        kFRO_HF_to_FLEXCOMM1 = MUX_A( CM_FXCOMCLKSEL1, 1 ),
        kAUDIO_PLL_to_FLEXCOMM1 = MUX_A( CM_FXCOMCLKSEL1, 2 ),
        kMCLK_to_FLEXCOMM1 = MUX_A( CM_FXCOMCLKSEL1, 3 ),
        kFRG_to_FLEXCOMM1 = MUX_A( CM_FXCOMCLKSEL1, 4 ),
        kNONE_to_FLEXCOMM1 = MUX_A( CM_FXCOMCLKSEL1, 7 ),

        kFRO12M_to_FLEXCOMM2 = MUX_A( CM_FXCOMCLKSEL2, 0 ),
        kFRO_HF_to_FLEXCOMM2 = MUX_A( CM_FXCOMCLKSEL2, 1 ),
        kAUDIO_PLL_to_FLEXCOMM2 = MUX_A( CM_FXCOMCLKSEL2, 2 ),
        kMCLK_to_FLEXCOMM2 = MUX_A( CM_FXCOMCLKSEL2, 3 ),
        kFRG_to_FLEXCOMM2 = MUX_A( CM_FXCOMCLKSEL2, 4 ),
        kNONE_to_FLEXCOMM2 = MUX_A( CM_FXCOMCLKSEL2, 7 ),

        kFRO12M_to_FLEXCOMM3 = MUX_A( CM_FXCOMCLKSEL3, 0 ),
        kFRO_HF_to_FLEXCOMM3 = MUX_A( CM_FXCOMCLKSEL3, 1 ),
        kAUDIO_PLL_to_FLEXCOMM3 = MUX_A( CM_FXCOMCLKSEL3, 2 ),
        kMCLK_to_FLEXCOMM3 = MUX_A( CM_FXCOMCLKSEL3, 3 ),
        kFRG_to_FLEXCOMM3 = MUX_A( CM_FXCOMCLKSEL3, 4 ),
        kNONE_to_FLEXCOMM3 = MUX_A( CM_FXCOMCLKSEL3, 7 ),

        kFRO12M_to_FLEXCOMM4 = MUX_A( CM_FXCOMCLKSEL4, 0 ),
        kFRO_HF_to_FLEXCOMM4 = MUX_A( CM_FXCOMCLKSEL4, 1 ),
        kAUDIO_PLL_to_FLEXCOMM4 = MUX_A( CM_FXCOMCLKSEL4, 2 ),
        kMCLK_to_FLEXCOMM4 = MUX_A( CM_FXCOMCLKSEL4, 3 ),
        kFRG_to_FLEXCOMM4 = MUX_A( CM_FXCOMCLKSEL4, 4 ),
        kNONE_to_FLEXCOMM4 = MUX_A( CM_FXCOMCLKSEL4, 7 ),

        kFRO12M_to_FLEXCOMM5 = MUX_A( CM_FXCOMCLKSEL5, 0 ),
        kFRO_HF_to_FLEXCOMM5 = MUX_A( CM_FXCOMCLKSEL5, 1 ),
        kAUDIO_PLL_to_FLEXCOMM5 = MUX_A( CM_FXCOMCLKSEL5, 2 ),
        kMCLK_to_FLEXCOMM5 = MUX_A( CM_FXCOMCLKSEL5, 3 ),
        kFRG_to_FLEXCOMM5 = MUX_A( CM_FXCOMCLKSEL5, 4 ),
        kNONE_to_FLEXCOMM5 = MUX_A( CM_FXCOMCLKSEL5, 7 ),

        kFRO12M_to_FLEXCOMM6 = MUX_A( CM_FXCOMCLKSEL6, 0 ),
        kFRO_HF_to_FLEXCOMM6 = MUX_A( CM_FXCOMCLKSEL6, 1 ),
        kAUDIO_PLL_to_FLEXCOMM6 = MUX_A( CM_FXCOMCLKSEL6, 2 ),
        kMCLK_to_FLEXCOMM6 = MUX_A( CM_FXCOMCLKSEL6, 3 ),
        kFRG_to_FLEXCOMM6 = MUX_A( CM_FXCOMCLKSEL6, 4 ),
        kNONE_to_FLEXCOMM6 = MUX_A( CM_FXCOMCLKSEL6, 7 ),

        kFRO12M_to_FLEXCOMM7 = MUX_A( CM_FXCOMCLKSEL7, 0 ),
        kFRO_HF_to_FLEXCOMM7 = MUX_A( CM_FXCOMCLKSEL7, 1 ),
        kAUDIO_PLL_to_FLEXCOMM7 = MUX_A( CM_FXCOMCLKSEL7, 2 ),
        kMCLK_to_FLEXCOMM7 = MUX_A( CM_FXCOMCLKSEL7, 3 ),
        kFRG_to_FLEXCOMM7 = MUX_A( CM_FXCOMCLKSEL7, 4 ),
        kNONE_to_FLEXCOMM7 = MUX_A( CM_FXCOMCLKSEL7, 7 ),

        kFRO12M_to_FLEXCOMM8 = MUX_A( CM_FXCOMCLKSEL8, 0 ),
        kFRO_HF_to_FLEXCOMM8 = MUX_A( CM_FXCOMCLKSEL8, 1 ),
        kAUDIO_PLL_to_FLEXCOMM8 = MUX_A( CM_FXCOMCLKSEL8, 2 ),
        kMCLK_to_FLEXCOMM8 = MUX_A( CM_FXCOMCLKSEL8, 3 ),
        kFRG_to_FLEXCOMM8 = MUX_A( CM_FXCOMCLKSEL8, 4 ),
        kNONE_to_FLEXCOMM8 = MUX_A( CM_FXCOMCLKSEL8, 7 ),

        kFRO12M_to_FLEXCOMM9 = MUX_A( CM_FXCOMCLKSEL9, 0 ),
        kFRO_HF_to_FLEXCOMM9 = MUX_A( CM_FXCOMCLKSEL9, 1 ),
        kAUDIO_PLL_to_FLEXCOMM9 = MUX_A( CM_FXCOMCLKSEL9, 2 ),
        kMCLK_to_FLEXCOMM9 = MUX_A( CM_FXCOMCLKSEL9, 3 ),
        kFRG_to_FLEXCOMM9 = MUX_A( CM_FXCOMCLKSEL9, 4 ),
        kNONE_to_FLEXCOMM9 = MUX_A( CM_FXCOMCLKSEL9, 7 ),

        kMAIN_CLK_to_FLEXCOMM10 = MUX_A( CM_FXCOMCLKSEL10, 0 ),
        kSYS_PLL_to_FLEXCOMM10 = MUX_A( CM_FXCOMCLKSEL10, 1 ),
        kUSB_PLL_to_FLEXCOMM10 = MUX_A( CM_FXCOMCLKSEL10, 2 ),
        kFRO_HF_to_FLEXCOMM10 = MUX_A( CM_FXCOMCLKSEL10, 3 ),
        kAUDIO_PLL_to_FLEXCOMM10 = MUX_A( CM_FXCOMCLKSEL10, 4 ),
        kNONE_to_FLEXCOMM10 = MUX_A( CM_FXCOMCLKSEL10, 7 ),

        kFRO_HF_to_MCLK = MUX_A( CM_MCLKCLKSEL, 0 ),
        kAUDIO_PLL_to_MCLK = MUX_A( CM_MCLKCLKSEL, 1 ),
        kNONE_to_MCLK = MUX_A( CM_MCLKCLKSEL, 7 ),

        kMAIN_CLK_to_FRG = MUX_A( CM_FRGCLKSEL, 0 ),
        kSYS_PLL_to_FRG = MUX_A( CM_FRGCLKSEL, 1 ),
        kFRO12M_to_FRG = MUX_A( CM_FRGCLKSEL, 2 ),
        kFRO_HF_to_FRG = MUX_A( CM_FRGCLKSEL, 3 ),
        kNONE_to_FRG = MUX_A( CM_FRGCLKSEL, 7 ),

        kFRO12M_to_DMIC = MUX_A( CM_DMICCLKSEL, 0 ),
        kFRO_HF_DIV_to_DMIC = MUX_A( CM_DMICCLKSEL, 1 ),
        kAUDIO_PLL_to_DMIC = MUX_A( CM_DMICCLKSEL, 2 ),
        kMCLK_to_DMIC = MUX_A( CM_DMICCLKSEL, 3 ),
        kMAIN_CLK_to_DMIC = MUX_A( CM_DMICCLKSEL, 4 ),
        kWDT_OSC_to_DMIC = MUX_A( CM_DMICCLKSEL, 5 ),
        kNONE_to_DMIC = MUX_A( CM_DMICCLKSEL, 7 ),

        kMAIN_CLK_to_SCT_CLK = MUX_A( CM_SCTCLKSEL, 0 ),
        kSYS_PLL_to_SCT_CLK = MUX_A( CM_SCTCLKSEL, 1 ),
        kFRO_HF_to_SCT_CLK = MUX_A( CM_SCTCLKSEL, 2 ),
        kAUDIO_PLL_to_SCT_CLK = MUX_A( CM_SCTCLKSEL, 3 ),
        kNONE_to_SCT_CLK = MUX_A( CM_SCTCLKSEL, 7 ),

        kMAIN_CLK_to_LCD_CLK = MUX_A( CM_LCDCLKSEL, 0 ),
        kLCDCLKIN_to_LCD_CLK = MUX_A( CM_LCDCLKSEL, 1 ),
        kFRO_HF_to_LCD_CLK = MUX_A( CM_LCDCLKSEL, 2 ),
        kNONE_to_LCD_CLK = MUX_A( CM_LCDCLKSEL, 3 ),

        kMAIN_CLK_to_SDIO_CLK = MUX_A( CM_SDIOCLKSEL, 0 ),
        kSYS_PLL_to_SDIO_CLK = MUX_A( CM_SDIOCLKSEL, 1 ),
        kUSB_PLL_to_SDIO_CLK = MUX_A( CM_SDIOCLKSEL, 2 ),
        kFRO_HF_to_SDIO_CLK = MUX_A( CM_SDIOCLKSEL, 3 ),
        kAUDIO_PLL_to_SDIO_CLK = MUX_A( CM_SDIOCLKSEL, 4 ),
        kNONE_to_SDIO_CLK = MUX_A( CM_SDIOCLKSEL, 7 ),

        kMAIN_CLK_to_ASYNC_APB = MUX_A( CM_ASYNCAPB, 0 ),
        kFRO12M_to_ASYNC_APB = MUX_A( CM_ASYNCAPB, 1 ),
        kAUDIO_PLL_to_ASYNC_APB = MUX_A( CM_ASYNCAPB, 2 ),
        kI2C_CLK_FC6_to_ASYNC_APB = MUX_A( CM_ASYNCAPB, 3 ),
        kNONE_to_NONE = ( int ) 0x80000000U,
    } clock_attach_id_t;

/*  Clock dividers */
    typedef enum _clock_div_name
    {
        kCLOCK_DivSystickClk = 0,
        kCLOCK_DivArmTrClkDiv = 1,
        kCLOCK_DivCan0Clk = 2,
        kCLOCK_DivCan1Clk = 3,
        kCLOCK_DivSmartCard0Clk = 4,
        kCLOCK_DivSmartCard1Clk = 5,
        kCLOCK_DivAhbClk = 32,
        kCLOCK_DivClkOut = 33,
        kCLOCK_DivFrohfClk = 34,
        kCLOCK_DivSpifiClk = 36,
        kCLOCK_DivAdcAsyncClk = 37,
        kCLOCK_DivUsb0Clk = 38,
        kCLOCK_DivUsb1Clk = 39,
        kCLOCK_DivFrg = 40,
        kCLOCK_DivDmicClk = 42,
        kCLOCK_DivMClk = 43,
        kCLOCK_DivLcdClk = 44,
        kCLOCK_DivSctClk = 45,
        kCLOCK_DivEmcClk = 46,
        kCLOCK_DivSdioClk = 47
    } clock_div_name_t;

