FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.h
/*******************************************************************************
 * API
 ******************************************************************************/

    #if defined( __cplusplus )
    extern "C" {
    #endif /* __cplusplus */

    static inline void CLOCK_EnableClock( clock_ip_name_t clk )
    {
        uint32_t index = CLK_GATE_ABSTRACT_REG_OFFSET( clk );

        if( index < 3UL )
        {
            SYSCON->AHBCLKCTRLSET[ index ] = ( 1UL << CLK_GATE_ABSTRACT_BITS_SHIFT( clk ) );
        }
        else
        {
            SYSCON->ASYNCAPBCTRL = SYSCON_ASYNCAPBCTRL_ENABLE( 1 );
            ASYNC_SYSCON->ASYNCAPBCLKCTRLSET = ( 1UL << CLK_GATE_ABSTRACT_BITS_SHIFT( clk ) );
        }
    }

    static inline void CLOCK_DisableClock( clock_ip_name_t clk )
    {
        uint32_t index = CLK_GATE_ABSTRACT_REG_OFFSET( clk );

        if( index < 3UL )
        {
            SYSCON->AHBCLKCTRLCLR[ index ] = ( 1UL << CLK_GATE_ABSTRACT_BITS_SHIFT( clk ) );
        }
        else
        {
            ASYNC_SYSCON->ASYNCAPBCLKCTRLCLR = ( 1UL << CLK_GATE_ABSTRACT_BITS_SHIFT( clk ) );
            SYSCON->ASYNCAPBCTRL = SYSCON_ASYNCAPBCTRL_ENABLE( 0 );
        }
    }

/**
 * @brief
 *  Initialize the Core clock to given frequency (12, 48 or 96 MHz), this API is implememnt in ROM code.
 * Turns on FRO and uses default CCO, if freq is 12000000, then high speed output is off, else high speed
 * output is enabled.
 * Usage: CLOCK_SetupFROClocking(frequency), (frequency must be one of 12, 48 or 96 MHz)
 *  Note: Need to make sure ROM and OTP has power(PDRUNCFG0[17,29]= 0U) before calling this API since this API is
 * implemented in ROM code and the FROHF TRIM value is stored in OTP
 *
 * @param froFreq target fro frequency.
 * @return   Nothing
 */

    void CLOCK_SetupFROClocking( uint32_t froFreq );

/**
 * @brief	Configure the clock selection muxes.
 * @param	connection	: Clock to be configured.
 * @return	Nothing
 */
    void CLOCK_AttachClk( clock_attach_id_t connection );

/**
 * @brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * @param   attachId  : Clock attach id to get.
 * @return  Clock source value.
 */
    clock_attach_id_t CLOCK_GetClockAttachId( clock_attach_id_t attachId );

/**
 * @brief	Setup peripheral clock dividers.
 * @param	div_name	: Clock divider name
 * @param divided_by_value: Value to be divided
 * @param reset :  Whether to reset the divider counter.
 * @return	Nothing
 */
    void CLOCK_SetClkDiv( clock_div_name_t div_name,
                          uint32_t divided_by_value,
                          bool reset );

/*! @brief	Return Frequency of selected clock
 *  @return	Frequency of selected clock
 */
    uint32_t CLOCK_GetFreq( clock_name_t clockName );

/*! @brief	Return Frequency of FRO 12MHz
 *  @return	Frequency of FRO 12MHz
 */
    uint32_t CLOCK_GetFro12MFreq( void );

/*! @brief	Return Frequency of ClockOut
 *  @return	Frequency of ClockOut
 */
    uint32_t CLOCK_GetClockOutClkFreq( void );

/*! @brief	Return Frequency of Spifi Clock
 *  @return	Frequency of Spifi.
 */
    uint32_t CLOCK_GetSpifiClkFreq( void );

/*! @brief	Return Frequency of Adc Clock
 *  @return	Frequency of Adc Clock.
 */
    uint32_t CLOCK_GetAdcClkFreq( void );

/*! brief	Return Frequency of MCAN Clock
 *  param	MCanSel : 0U: MCAN0; 1U: MCAN1
 *  return	Frequency of MCAN Clock
 */
    uint32_t CLOCK_GetMCanClkFreq( uint32_t MCanSel );

/*! @brief	Return Frequency of Usb0 Clock
 *  @return	Frequency of Usb0 Clock.
 */
    uint32_t CLOCK_GetUsb0ClkFreq( void );

/*! @brief	Return Frequency of Usb1 Clock
 *  @return	Frequency of Usb1 Clock.
 */
    uint32_t CLOCK_GetUsb1ClkFreq( void );

/*! @brief	Return Frequency of MClk Clock
 *  @return	Frequency of MClk Clock.
 */
    uint32_t CLOCK_GetMclkClkFreq( void );

/*! @brief	Return Frequency of SCTimer Clock
 *  @return	Frequency of SCTimer Clock.
 */
    uint32_t CLOCK_GetSctClkFreq( void );

/*! @brief	Return Frequency of SDIO Clock
 *  @return	Frequency of SDIO Clock.
 */
    uint32_t CLOCK_GetSdioClkFreq( void );

/*! @brief	Return Frequency of LCD Clock
 *  @return	Frequency of LCD Clock.
 */
    uint32_t CLOCK_GetLcdClkFreq( void );

/*! @brief	Return Frequency of LCD CLKIN Clock
 *  @return	Frequency of LCD CLKIN Clock.
 */
    uint32_t CLOCK_GetLcdClkIn( void );

/*! @brief	Return Frequency of External Clock
 *  @return	Frequency of External Clock. If no external clock is used returns 0.
 */
    uint32_t CLOCK_GetExtClkFreq( void );

/*! @brief	Return Frequency of Watchdog Oscillator
 *  @return	Frequency of Watchdog Oscillator
 */
    uint32_t CLOCK_GetWdtOscFreq( void );

/*! @brief	Return Frequency of High-Freq output of FRO
 *  @return	Frequency of High-Freq output of FRO
 */
    uint32_t CLOCK_GetFroHfFreq( void );

/*! @brief  Return Frequency of frg
 *  @return Frequency of FRG
 */
    uint32_t CLOCK_GetFrgClkFreq( void );

/*! @brief  Return Frequency of dmic
 *  @return Frequency of DMIC
 */
    uint32_t CLOCK_GetDmicClkFreq( void );

/*!
 * @brief Set FRG Clk
 * @return
 *        1: if set FRG CLK successfully.
 *        0: if set FRG CLK fail.
 */
    uint32_t CLOCK_SetFRGClock( uint32_t freq );

/*! @brief	Return Frequency of PLL
 *  @return	Frequency of PLL
 */
    uint32_t CLOCK_GetPllOutFreq( void );

/*! @brief	Return Frequency of USB PLL
 *  @return	Frequency of PLL
 */
    uint32_t CLOCK_GetUsbPllOutFreq( void );

/*! @brief	Return Frequency of AUDIO PLL
 *  @return	Frequency of PLL
 */
    uint32_t CLOCK_GetAudioPllOutFreq( void );

/*! @brief	Return Frequency of 32kHz osc
 *  @return	Frequency of 32kHz osc
 */
    uint32_t CLOCK_GetOsc32KFreq( void );

/*! @brief	Return Frequency of Core System
 *  @return	Frequency of Core System
 */
    uint32_t CLOCK_GetCoreSysClkFreq( void );

/*! @brief	Return Frequency of I2S MCLK Clock
 *  @return	Frequency of I2S MCLK Clock
 */
    uint32_t CLOCK_GetI2SMClkFreq( void );

/*! @brief	Return Frequency of Flexcomm functional Clock
 *  @return	Frequency of Flexcomm functional Clock
 */
    uint32_t CLOCK_GetFlexCommClkFreq( uint32_t id );

/*! @brief return FRG Clk
 *  @return Frequency of FRG CLK.
 */
    uint32_t CLOCK_GetFRGInputClock( void );

/*! @brief	Return Asynchronous APB Clock source
 *  @return	Asynchronous APB CLock source
 */
    __STATIC_INLINE async_clock_src_t CLOCK_GetAsyncApbClkSrc( void )
    {
        return ( async_clock_src_t ) ( uint32_t ) ( ASYNC_SYSCON->ASYNCAPBCLKSELA & 0x3U );
    }

/*! @brief	Return Frequency of Asynchronous APB Clock
 *  @return	Frequency of Asynchronous APB Clock Clock
 */
    uint32_t CLOCK_GetAsyncApbClkFreq( void );

/*! @brief	Return EMC source
 *  @return	EMC source
 */
    __STATIC_INLINE uint32_t CLOCK_GetEmcClkFreq( void )
    {
        uint32_t freqtmp;

        freqtmp = CLOCK_GetCoreSysClkFreq() / ( ( SYSCON->AHBCLKDIV & 0xffU ) + 1U );
        return freqtmp / ( ( SYSCON->EMCCLKDIV & 0xffU ) + 1U );
    }

/*! @brief	Return Audio PLL input clock rate
 *  @return	Audio PLL input clock rate
 */
    uint32_t CLOCK_GetAudioPLLInClockRate( void );

