FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.h
/*! @brief	Return System PLL input clock rate
 *  @return	System PLL input clock rate
 */
    uint32_t CLOCK_GetSystemPLLInClockRate( void );

/*! @brief	Return System PLL output clock rate
 *  @param	recompute	: Forces a PLL rate recomputation if true
 *  @return	System PLL output clock rate
 *  @note	The PLL rate is cached in the driver in a variable as
 *  the rate computation function can take some time to perform. It
 *  is recommended to use 'false' with the 'recompute' parameter.
 */
    uint32_t CLOCK_GetSystemPLLOutClockRate( bool recompute );

/*! @brief	Return System AUDIO PLL output clock rate
 *  @param	recompute	: Forces a AUDIO PLL rate recomputation if true
 *  @return	System AUDIO PLL output clock rate
 *  @note	The AUDIO PLL rate is cached in the driver in a variable as
 *  the rate computation function can take some time to perform. It
 *  is recommended to use 'false' with the 'recompute' parameter.
 */
    uint32_t CLOCK_GetAudioPLLOutClockRate( bool recompute );

/*! @brief	Return System USB PLL output clock rate
 *  @param	recompute	: Forces a USB PLL rate recomputation if true
 *  @return	System USB PLL output clock rate
 *  @note	The USB PLL rate is cached in the driver in a variable as
 *  the rate computation function can take some time to perform. It
 *  is recommended to use 'false' with the 'recompute' parameter.
 */
    uint32_t CLOCK_GetUsbPLLOutClockRate( bool recompute );

/*! @brief	Enables and disables PLL bypass mode
 *  @brief	bypass	: true to bypass PLL (PLL output = PLL input, false to disable bypass
 *  @return	System PLL output clock rate
 */
    __STATIC_INLINE void CLOCK_SetBypassPLL( bool bypass )
    {
        if( bypass )
        {
            SYSCON->SYSPLLCTRL |= ( 1UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT );
        }
        else
        {
            SYSCON->SYSPLLCTRL &= ~( 1UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT );
        }
    }

/*! @brief	Check if PLL is locked or not
 *  @return	true if the PLL is locked, false if not locked
 */
    __STATIC_INLINE bool CLOCK_IsSystemPLLLocked( void )
    {
        return ( bool ) ( ( SYSCON->SYSPLLSTAT & SYSCON_SYSPLLSTAT_LOCK_MASK ) != 0U );
    }

/*! @brief	Check if USB PLL is locked or not
 *  @return	true if the USB PLL is locked, false if not locked
 */
    __STATIC_INLINE bool CLOCK_IsUsbPLLLocked( void )
    {
        return ( bool ) ( ( SYSCON->USBPLLSTAT & SYSCON_USBPLLSTAT_LOCK_MASK ) != 0U );
    }

/*! @brief	Check if AUDIO PLL is locked or not
 *  @return	true if the AUDIO PLL is locked, false if not locked
 */
    __STATIC_INLINE bool CLOCK_IsAudioPLLLocked( void )
    {
        return ( bool ) ( ( SYSCON->AUDPLLSTAT & SYSCON_AUDPLLSTAT_LOCK_MASK ) != 0U );
    }

/*! @brief	Enables and disables SYS OSC
 *  @brief	enable	: true to enable SYS OSC, false to disable SYS OSC
 */
    __STATIC_INLINE void CLOCK_Enable_SysOsc( bool enable )
    {
        if( enable )
        {
            SYSCON->PDRUNCFGCLR[ 0 ] |= SYSCON_PDRUNCFG_PDEN_VD2_ANA_MASK;
            SYSCON->PDRUNCFGCLR[ 1 ] |= SYSCON_PDRUNCFG_PDEN_SYSOSC_MASK;
        }

        else
        {
            SYSCON->PDRUNCFGSET[ 0 ] = SYSCON_PDRUNCFG_PDEN_VD2_ANA_MASK;
            SYSCON->PDRUNCFGSET[ 1 ] = SYSCON_PDRUNCFG_PDEN_SYSOSC_MASK;
        }
    }

/*! @brief Store the current PLL rate
 *  @param	rate: Current rate of the PLL
 *  @return	Nothing
 **/
    void CLOCK_SetStoredPLLClockRate( uint32_t rate );

/*! @brief Store the current AUDIO PLL rate
 *  @param	rate: Current rate of the PLL
 *  @return	Nothing
 **/
    void CLOCK_SetStoredAudioPLLClockRate( uint32_t rate );

/*! @brief PLL configuration structure flags for 'flags' field
 * These flags control how the PLL configuration function sets up the PLL setup structure.<br>
 *
 * When the PLL_CONFIGFLAG_USEINRATE flag is selected, the 'InputRate' field in the
 * configuration structure must be assigned with the expected PLL frequency. If the
 * PLL_CONFIGFLAG_USEINRATE is not used, 'InputRate' is ignored in the configuration
 * function and the driver will determine the PLL rate from the currently selected
 * PLL source. This flag might be used to configure the PLL input clock more accurately
 * when using the WDT oscillator or a more dyanmic CLKIN source.<br>
 *
 * When the PLL_CONFIGFLAG_FORCENOFRACT flag is selected, the PLL hardware for the
 * automatic bandwidth selection, Spread Spectrum (SS) support, and fractional M-divider
 * are not used.<br>
 */
    #define PLL_CONFIGFLAG_USEINRATE    ( 1U << 0U ) /*!< Flag to use InputRate in PLL configuration structure for setup */
    #define PLL_CONFIGFLAG_FORCENOFRACT \
    ( 1U << 2U )                                     /*!< Force non-fractional output mode, PLL output will not use the fractional, automatic bandwidth, or \
                                                      * SS hardware */

/*! @brief PLL configuration structure
 *
 * This structure can be used to configure the settings for a PLL
 * setup structure. Fill in the desired configuration for the PLL
 * and call the PLL setup function to fill in a PLL setup structure.
 */
    typedef struct _pll_config
    {
        uint32_t desiredRate; /*!< Desired PLL rate in Hz */
        uint32_t inputRate;   /*!< PLL input clock in Hz, only used if PLL_CONFIGFLAG_USEINRATE flag is set */
        uint32_t flags;       /*!< PLL configuration flags, Or'ed value of PLL_CONFIGFLAG_* definitions */
    } pll_config_t;

/*! @brief PLL setup structure flags for 'flags' field
 * These flags control how the PLL setup function sets up the PLL
 */
    #define PLL_SETUPFLAG_POWERUP     ( 1U << 0U ) /*!< Setup will power on the PLL after setup */
    #define PLL_SETUPFLAG_WAITLOCK    ( 1U << 1U ) /*!< Setup will wait for PLL lock, implies the PLL will be pwoered on */
    #define PLL_SETUPFLAG_ADGVOLT     ( 1U << 2U ) /*!< Optimize system voltage for the new PLL rate */

/*! @brief PLL setup structure
 * This structure can be used to pre-build a PLL setup configuration
 * at run-time and quickly set the PLL to the configuration. It can be
 * populated with the PLL setup function. If powering up or waiting
 * for PLL lock, the PLL input clock source should be configured prior
 * to PLL setup.
 */
    typedef struct _pll_setup
    {
        uint32_t pllctrl;    /*!< PLL control register SYSPLLCTRL */
        uint32_t pllndec;    /*!< PLL NDEC register SYSPLLNDEC */
        uint32_t pllpdec;    /*!< PLL PDEC register SYSPLLPDEC */
        uint32_t pllmdec;    /*!< PLL MDEC registers SYSPLLPDEC */
        uint32_t pllRate;    /*!< Acutal PLL rate */
        uint32_t audpllfrac; /*!< only aduio PLL has this function*/
        uint32_t flags;      /*!< PLL setup flags, Or'ed value of PLL_SETUPFLAG_* definitions */
    } pll_setup_t;

